modm-ext/data.modm.io/docs/svd/header_stm32u5a9xx.svd
        <register>
          <name>VVACCR</name>
          <description>DSI Host Video VA Current Configuration Register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VA0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA7</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA8</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA9</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA10</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA11</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA12</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VA13</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FBSR</name>
          <description>DSI Host FIFO and Buffer Status Register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VCWFE</name>
              <description>Video mode Command Write FIFO Empty</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VCWFF</name>
              <description>Video mode Command Write FIFO Full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VPWFE</name>
              <description>Video mode Payload Write FIFO Empty</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VPWFF</name>
              <description>Video mode Payload Write FIFO Full</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACWFE</name>
              <description>Adapted mode Command Write FIFO Empty</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACWFF</name>
              <description>Adapted mode Command Write FIFO Full</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APWFE</name>
              <description>Adapted mode Payload Write FIFO Empty</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APWFF</name>
              <description>Adapted mode Payload Write FIFO Full</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VPBE</name>
              <description>Video mode Payload Buffer Empty</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VPBF</name>
              <description>Video mode Payload Buffer Full</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACBE</name>
              <description>Adapted mode Command Buffer Empty</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACBF</name>
              <description>Adapted mode Command Buffer Full</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APBE</name>
              <description>Adapted mode Payload Buffer Empty</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APBF</name>
              <description>Adapted mode Payload Buffer Full</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WCFGR</name>
          <description>DSI Wrapper Configuration Register</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DSIM</name>
              <description>DSI Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLMUX0</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLMUX1</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLMUX2</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TESRC</name>
              <description>Tearing Effect Source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEPOL</name>
              <description>Tearing Effect Polarity</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AR</name>
              <description>Automatic Refresh</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSPOL</name>
              <description>VSync Polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WCR</name>
          <description>DSI Wrapper Control Register</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COLM</name>
              <description>Color Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHTDN</name>
              <description>Shutdown</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LTDCEN</name>
              <description>LTDC Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSIEN</name>
              <description>DSI Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WIER</name>
          <description>DSI Wrapper Interrupt Enable Register</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TEIE</name>
              <description>Tearing Effect Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERIE</name>
              <description>End of Refresh Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLLIE</name>
              <description>PLL Lock Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLUIE</name>
              <description>PLL Unlock Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WISR</name>
          <description>DSI Wrapper Interrupt and Status Register</description>
          <addressOffset>0x40c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TEIF</name>
              <description>Tearing Effect Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERIF</name>
              <description>End of Refresh Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLLS</name>
              <description>PLL Lock Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLLIF</name>
              <description>PLL Lock Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLUIF</name>
              <description>PLL Unlock Interrupt Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WIFCR</name>
          <description>DSI Wrapper Interrupt Flag Clear Register</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CTEIF</name>
              <description>Clear Tearing Effect Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CERIF</name>
              <description>Clear End of Refresh Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPLLLIF</name>
              <description>Clear PLL Lock Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPLLUIF</name>
              <description>Clear PLL Unlock Interrupt Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPCR0</name>
          <description>DSI Wrapper PHY Configuration Register 0</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWCL</name>
              <description>Swap pins on clock lane</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWDL0</name>
              <description>Swap pins on data lane 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWDL1</name>
              <description>Swap pins on data lane 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTXSMCL</name>
              <description>Force clock lane in TX stop mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTXSMDL</name>
              <description>Force data lanes in TX stop mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPCR</name>
          <description>DSI Wrapper Regulator and PLL Control Register</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLLEN</name>
              <description>PLL Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_NDIV0</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_NDIV1</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_NDIV2</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_NDIV3</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_NDIV4</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_NDIV5</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_NDIV6</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_NDIV7</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_NDIV8</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_IDF0</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_IDF1</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_IDF2</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_IDF3</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_IDF4</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_IDF5</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_IDF6</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_IDF7</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_IDF8</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_ODF0</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_ODF1</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_ODF2</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_ODF3</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_ODF4</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_ODF5</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_ODF6</name>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_ODF7</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_ODF8</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BC</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPTR</name>
          <description>DSI Wrapper PLL tuning register</description>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CP0</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP2</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP3</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPF0</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPF1</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPF2</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPF3</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCFGR</name>
          <description>DSI Bias Configuration Register</description>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PWRUP</name>
              <description>Reference bias power up</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPCBCR</name>
          <description>D-PHY clock band control register</description>
          <addressOffset>0xc04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DPCBCR</name>
              <description>clock band control register</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPCSRCR</name>
          <description>D-PHY clock slew rate control register</description>
          <addressOffset>0xc34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DPCSRCR</name>
              <description>clock slew rate control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPDL0HSOCR</name>
          <description>D-PHY data Lane 0 HS</description>
          <addressOffset>0xc5c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSPRPO0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSPRPO1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPDL0HSOCR</name>
              <description>data lane0 HS Prepare offset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPDL0LPXOCR</name>
          <description>D-PHY data Lane 0 HS LPX</description>
          <addressOffset>0xc60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPXO0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPXO1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPDL0LPXOCR</name>
              <description>data lane 0 LPX Offset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPDL0BCR</name>
          <description>D-PHY data Lane0 band control register</description>
          <addressOffset>0xc70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DPDL0BCR</name>
              <description>data lane 0 band control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPDL0SRCR</name>
          <description>D-PHY data Lane0 slew rate control register</description>
          <addressOffset>0xca0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DPDL0SRCR</name>
              <description>data lane 0 slew rate control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
