modm-ext/data.modm.io/docs/svd/header_stm32u5a9xx.svd
        <register>
          <name>PRIVCFGR13</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR14</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR15</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x23c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR16</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR17</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR18</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR19</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x24c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR20</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR21</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR22</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR23</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x25c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR24</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR25</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR26</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR27</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x26c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR28</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR29</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR30</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x278</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR31</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x27c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR32</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR33</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR34</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR35</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x28c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR36</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR37</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR38</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR39</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x29c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR40</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR41</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR42</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR43</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR44</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR45</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR46</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR47</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR48</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR49</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR50</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVCFGR51</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x2cc</addressOffset>
          <size>0x20</size>
        </register>
