modm-ext/data.modm.io/docs/svd/header_stm32u5a9xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>System configuration controller</description>
      <baseAddress>0x46000400</baseAddress>
      <registers>
        <register>
          <name>SECCFGR</name>
          <description>SYSCFG secure configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYSCFGSEC</name>
              <description>SYSCFG clock control security enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLASSBSEC</name>
              <description>ClassB SYSCFG security enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPUSEC</name>
              <description>FPU SYSCFG security enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR1</name>
          <description>SYSCFG configuration register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOOSTEN</name>
              <description>I/O analog switch voltage booster enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ANASWVDD</name>
              <description>GPIO analog switch control voltage selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB6_FMP</name>
              <description>PB6 Fast mode plus</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB7_FMP</name>
              <description>PB7 Fast mode plus</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB8_FMP</name>
              <description>PB8 Fast mode plus</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB9_FMP</name>
              <description>PB9 Fast mode plus</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENDCAP</name>
              <description>Enable decoupling capacitance on HSPI supply</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Decoupling with no capacitance value on HSPI supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPACITANCE_1_DIV_3</name>
                  <description>Decoupling with 1/3 of capacitance value on HSPI supply</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPACITANCE_2_DIV_3</name>
                  <description>Decoupling with 2/3 of capacitance value on HSPI supply</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Decoupling with full capacitance value on HSPI supply</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMCACHED</name>
              <description>Enable the cachability of internal SRAMx by the DCACHE2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FPUIMR</name>
          <description>SYSCFG FPU interrupt mask register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FPU_IE</name>
              <description>All FPU interrupts enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSLCKR</name>
          <description>SYSCFG CPU non-secure lock register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCKNSVTOR</name>
              <description>Disable VTOR_NS register writes by SW or debug agent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKNSMPU</name>
              <description>Disable Non-Secure MPU registers writes by SW or debug agent</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSLCKR</name>
          <description>SYSCFG CPU secure lock register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCKSVTAIRCR</name>
              <description>Disable changes to the secure vector table address, handling of system faults</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKSMPU</name>
              <description>Disable changes to the secure MPU registers writes by SW or debug agent</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKSAU</name>
              <description>Disable changes to SAU registers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>SYSCFG configuration register 2</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLL</name>
              <description>Core Lockup Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPL</name>
              <description>SRAM ECC Lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDL</name>
              <description>PVD Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCL</name>
              <description>ECC Lock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MESR</name>
          <description>SYSCFG Memory Erase Status register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MCLR</name>
              <description>Status of Erase after Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPMEE</name>
              <description>Status of End of Erase for ICache and PKA RAMs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCSR</name>
          <description>SYSCFG Conpensaion Cell Control&amp;Status register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN1</name>
              <description>Enable compensation cell for VDD power rail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS1</name>
              <description>Code selection for VDD power rail</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN2</name>
              <description>Enable compensation cell for VDDIO power rail</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS2</name>
              <description>Code selection for VDDIO power rail</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN3</name>
              <description>Enable compensation cell for HSPI I/Os</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS3</name>
              <description>Code selection for HSPI I/Os</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDY1</name>
              <description>VDD compensation cell ready flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDY2</name>
              <description>VDDIO compensation cell ready flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDY3</name>
              <description>HSPI I/Os compensation cell ready flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCVR</name>
          <description>SYSCFG Conpensaion Cell value register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NCV1</name>
              <description>NMOS compensation value for VDD Power Rail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PCV1</name>
              <description>PMOS compensation value for VDD Power Rail</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NCV2</name>
              <description>NMOS compensation value for VDDIO Power Rail</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PCV2</name>
              <description>PMOS compensation value for VDDIO Power Rail</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NCV3</name>
              <description>NMOS compensation value of the HSPI I/Os supplied by VDD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PCV3</name>
              <description>PMOS compensation value of the HSPI I/Os supplied by VDD</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCR</name>
          <description>SYSCFG Conpensaion Cell Code register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NCC1</name>
              <description>NMOS compensation code for VDD Power Rail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PCC1</name>
              <description>PMOS compensation code for VDD Power Rail</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NCC2</name>
              <description>NMOS compensation code for VDDIO Power Rail</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PCC2</name>
              <description>PMOS compensation code for VDDIO Power Rail</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NCC3</name>
              <description>NMOS compensation code of the HSPI I/Os supplied by VDD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PCC3</name>
              <description>PMOS compensation code of the HSPI I/Os supplied by VDD</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSCMDR</name>
          <description>SYSCFG RSS command mode register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RSSCMD</name>
              <description>RSS command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTGHSPHYCR</name>
          <description>SYSCFG USB OTG_HS PHY register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>USB OTG_HS PHY enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDCTRL</name>
              <description>USB OTG_HS PHY common block power-down control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>USB OTG_HS PHY reference clock frequency selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_16MHZ</name>
                  <description>Reference clock freqeuncy is 16 Mhz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_19_2MHZ</name>
                  <description>Reference clock freqeuncy is 19.2 Mhz</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_20MHZ</name>
                  <description>Reference clock freqeuncy is 20 Mhz</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_24MHZ</name>
                  <description>Reference clock freqeuncy is 24 Mhz</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_26MHZ</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_32MHZ</name>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OTGHSPHYTUNER2</name>
          <description>SYSCFG USB OTG_HS PHY tune register 2</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMPDISTUNE</name>
              <description>Disconnect threshold adjustment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISCONNECT_5_9PERCENT</name>
                  <description>+5.9% (recommended value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONNECT_0PERCENT</name>
                  <description>0% (default value)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SQRXTUNE</name>
              <description>Squelch threshold adjustment</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SQUELCH_15PERCENT</name>
                  <description>+15% (recommended value)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SQUELCH_0PERCENT</name>
                  <description>0% (default value)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPREEMPAMPTUNE</name>
              <description>High-speed transmitter preemphasis current control</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>HS transmitter preemphasis circuit disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREEMP_1X</name>
                  <description>HS transmitter preemphasis circuit sources 1x preemphasis current</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREEMP_2X</name>
                  <description>HS transmitter preemphasis circuit sources 2x preemphasis current</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREEMP_3X</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
