modm-ext/data.modm.io/docs/svd/header_stm32u5a9xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM2_S</name>
      <description>TIM</description>
      <baseAddress>0x50000000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM3_S</name>
      <description>TIM</description>
      <baseAddress>0x50000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM4_S</name>
      <description>TIM</description>
      <baseAddress>0x50000800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM5_S</name>
      <description>TIM</description>
      <baseAddress>0x50000c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM6_S</name>
      <description>TIM</description>
      <baseAddress>0x50001000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM7_S</name>
      <description>TIM</description>
      <baseAddress>0x50001400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="WWDG">
      <name>WWDG_S</name>
      <description>WWDG</description>
      <baseAddress>0x50002c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="IWDG">
      <name>IWDG_S</name>
      <description>IWDG</description>
      <baseAddress>0x50003000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI2_S</name>
      <description>SPI</description>
      <baseAddress>0x50003800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART2_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART3_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART4_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50004c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART5_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C1_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x50005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x50005800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="CRS">
      <name>CRS_S</name>
      <description>Clock Recovery System</description>
      <baseAddress>0x50006000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART6_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50006400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x50008400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM2_S</name>
      <description>LPTIMER</description>
      <baseAddress>0x50009400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C5_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x50009800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C6_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x50009c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN1">
      <name>FDCAN1_S</name>
      <description>FD Controller Area Network</description>
      <baseAddress>0x5000a400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN_CONFIG">
      <name>FDCAN_CONFIG_S</name>
      <description>FD Controller Area Network Configuration</description>
      <baseAddress>0x5000a500</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UCPD1">
      <name>UCPD1_S</name>
      <description>UCPD</description>
      <baseAddress>0x5000dc00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM1">
      <name>TIM1_S</name>
      <description>TIM</description>
      <baseAddress>0x50012c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI1_S</name>
      <description>SPI</description>
      <baseAddress>0x50013000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM8">
      <name>TIM8_S</name>
      <description>TIM</description>
      <baseAddress>0x50013400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART1_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50013800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM15">
      <name>TIM15_S</name>
      <description>TIM</description>
      <baseAddress>0x50014000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM16">
      <name>TIM16_S</name>
      <description>TIM</description>
      <baseAddress>0x50014400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM16">
      <name>TIM17_S</name>
      <description>TIM</description>
      <baseAddress>0x50014800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SAI1">
      <name>SAI1_S</name>
      <description>Serial Audio Interface</description>
      <baseAddress>0x50015400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SAI1">
      <name>SAI2_S</name>
      <description>Serial Audio Interface</description>
      <baseAddress>0x50015800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LTDC">
      <name>LTDC_S</name>
      <description>LCD-TFT Display Controller</description>
      <baseAddress>0x50016800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DSI">
      <name>DSI_S</name>
      <description>DSI Controller</description>
      <baseAddress>0x50016c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPDMA1">
      <name>GPDMA1_S</name>
      <description>DMA Controller</description>
      <baseAddress>0x50020000</baseAddress>
    </peripheral>
